nakhonthai/ESP32APRS_Audio/src/main.cpp
    /* Direction from Aviation Formulary V1.42 by Ed Williams by way of
     * http://mathforum.org/library/drmath/view/55417.html */
    direction = atan2(sin(lon1 - lon0) * cos(lat1), cos(lat0) * sin(lat1) - sin(lat0) * cos(lat1) * cos(lon1 - lon0));
    if (direction < 0)
    {
        /* Make direction positive. */
        direction += 2 * PI;
    }

    return RAD2DEG(direction);
}

double distance(double lon0, double lat0, double lon1, double lat1)
{
    double dlon;
    double dlat;
    double a, c;
    /* Convert degrees into radians. */
    lon0 = DEG2RAD(lon0);
    lat0 = DEG2RAD(lat0);
    lon1 = DEG2RAD(lon1);
    lat1 = DEG2RAD(lat1);

    /* Use the haversine formula for distance calculation
     * http://mathforum.org/library/drmath/view/51879.html */
    dlon = lon1 - lon0;
    dlat = lat1 - lat0;
    a = pow(sin(dlat / 2), 2) + cos(lat0) * cos(lat1) * pow(sin(dlon / 2), 2);
    c = 2 * atan2(sqrt(a), sqrt(1 - a));

    return c * 6366.71; /* in kilometers */
}

void deg2lat(char *dmm, double deg)
{
    char sign;
    if (deg > 0.0F)
    {
        sign = 'N';
    }
    else
    {
        sign = 'S';
        deg *= -1;
    }

    uint id = (uint)floor(deg);
    uint im = (uint)((deg - (double)id) * 60);
    uint imm = (uint)round((((deg - (double)id) * 60) - (double)im) * 100);
    sprintf(dmm, "%02d%02d.%02d%c", id, im, imm, sign);
}

void deg2lon(char *dmm, double deg)
{
    char sign;
    if (deg > 0.0F)
    {
        sign = 'E';
    }
    else
    {
        sign = 'W';
        deg *= -1;
    }
    uint id = (uint)floor(deg);
    uint im = (uint)((deg - (double)id) * 60);
    uint imm = (uint)round((((deg - (double)id) * 60) - (double)im) * 100);
    sprintf(dmm, "%03d%02d.%02d%c", id, im, imm, sign);
}

String deg2lat(double deg)
{
    char sign;
    if (deg > 0.0F)
    {
        sign = 'N';
    }
    else
    {
        sign = 'S';
        deg *= -1;
    }

    uint id = (uint)floor(deg);
    uint im = (uint)((deg - (double)id) * 60);
    uint imm = (uint)round((((deg - (double)id) * 60) - (double)im) * 100);
    char dmm[10];
    sprintf(dmm, "%02d%02d.%02d%c", id, im, imm, sign);
    return String(dmm);
}

String deg2lon(double deg)
{
    char sign;
    if (deg > 0.0F)
    {
        sign = 'E';
    }
    else
    {
        sign = 'W';
        deg *= -1;
    }
    uint id = (uint)floor(deg);
    uint im = (uint)((deg - (double)id) * 60);
    uint imm = (uint)round((((deg - (double)id) * 60) - (double)im) * 100);
    char dmm[10];
    sprintf(dmm, "%03d%02d.%02d%c", id, im, imm, sign);
    return String(dmm);
}

time_t setGpsTime()
{
    time_t time;
    tmElements_t timeinfo;
    if (gps.time.isValid())
    {
        timeinfo.Year = (gps.date.year()) - 1970;
        timeinfo.Month = gps.date.month();
        timeinfo.Day = gps.date.day();
        timeinfo.Hour = gps.time.hour();
        timeinfo.Minute = gps.time.minute();
        timeinfo.Second = gps.time.second();
        time_t timeStamp = makeTime(timeinfo);
        time = timeStamp + config.timeZone * SECS_PER_HOUR;
        setTime(time);
        // setTime(timeinfo.Hour,timeinfo.Minute,timeinfo.Second,timeinfo.Day, timeinfo.Month, timeinfo.Year);
        return time;
    }
    return 0;
}

time_t getGpsTime()
{
    time_t time;
    tmElements_t timeinfo;
    if (gps.time.isValid())
    {
        timeinfo.Year = (gps.date.year()) - 1970;
        timeinfo.Month = gps.date.month();
        timeinfo.Day = gps.date.day();
        timeinfo.Hour = gps.time.hour();
        timeinfo.Minute = gps.time.minute();
        timeinfo.Second = gps.time.second();
        time_t timeStamp = makeTime(timeinfo);
        time = timeStamp + config.timeZone * SECS_PER_HOUR;
        return time;
    }
    return 0;
}

String getValue(String data, char separator, int index)
{
    int found = 0;
    int strIndex[] = {0, -1};
    int maxIndex = data.length();

    for (int i = 0; i <= maxIndex && found <= index; i++)
    {
        if (data.charAt(i) == separator || i == maxIndex)
        {
            found++;
            strIndex[0] = strIndex[1] + 1;
            strIndex[1] = (i == maxIndex) ? i + 1 : i;
        }
    }
    return found > index ? data.substring(strIndex[0], strIndex[1]) : "";
} // END

boolean isValidNumber(String str)
{
    for (int i = 0; i < str.length(); i++)
    {
        if (isDigit(str.charAt(i)))
            return true;
    }
    return false;
}

uint8_t checkSum(uint8_t *ptr, size_t count)
{
    uint8_t lrc, tmp;
    uint16_t i;
    lrc = 0;
    for (i = 0; i < count; i++)
    {
        tmp = *ptr++;
        lrc = lrc ^ tmp;
    }
    return lrc;
}

// void saveEEPROM()
// {
//     uint8_t chkSum = 0;
//     byte *ptr;
//     ptr = (byte *)&config;
//     EEPROM.writeBytes(1, ptr, sizeof(Configuration));
//     chkSum = checkSum(ptr, sizeof(Configuration));
//     EEPROM.write(0, chkSum);
//     EEPROM.commit();
// #ifdef DEBUG
//     Serial.print("Save EEPROM ChkSUM=");
//     Serial.println(chkSum, HEX);
// #endif
// }

void logTracker(double lat, double lon, double speed, double course)
{
    char data[200];
    char datetime[30];
    char dfName[30];
    bool header = false;
    double dist;
    time_t nowTime;

    if (gps.time.isValid())
    {
        time_t timeGps = getGpsTime(); // Local gps time
        time(&nowTime);
        int tdiff = abs(timeGps - nowTime);
        if (timeGps > 1700000000 && tdiff > 2) // && timeGps < 2347462800)
        {
            nowTime = timeGps;
            setTime(nowTime);
            time_t rtc = nowTime - (time_t)(config.timeZone * (float)SECS_PER_HOUR);
            timeval tv = {rtc, 0};
            timezone tz = {(int)(config.timeZone * (float)SECS_PER_HOUR), 0};
            settimeofday(&tv, &tz);
        }
    }
    else
    {
        time(&nowTime);
    }

    String col;
    struct tm tmstruct;
    getLocalTime(&tmstruct, 100);
    sprintf(dfName, "/trk_%02d%d.csv", (tmstruct.tm_mon) + 1, (tmstruct.tm_year) + 1900);

    if (lastTimeStamp == 0)
        lastTimeStamp = nowTime;
    time_t tdiff = nowTime - lastTimeStamp;
    double nowLat = gps.location.lat();
    double nowLng = gps.location.lng();
    double spd = gps.speed.kmph();

    // dist = distance(LastLng, LastLat, nowLng, nowLat);

    if (spd < 5)
    {

