nakhonthai/ESP32APRS_Audio/src/main.cpp
bool pkgTxDuplicate(AX25Msg ax25)
{
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    char callsign[12];
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            if (txQueue[i].Channel & INET_CHANNEL)
                continue;

            if (ax25.src.ssid > 0)
                sprintf(callsign, "%s-%d", ax25.src.call, ax25.src.ssid);
            else
                sprintf(callsign, "%s", ax25.src.call);
            if (strncmp(&txQueue[i].Info[0], callsign, strlen(callsign)) >= 0) // Check duplicate src callsign
            {
                char *ecs1 = strstr(txQueue[i].Info, ":");
                if (ecs1 == NULL)
                    continue;
                ;
                if (strncmp(ecs1, (const char *)ax25.info, strlen(ecs1)) >= 0)
                { // Check duplicate aprs info
                    txQueue[i].Active = false;
                    psramBusy = false;
                    return true;
                }
            }
        }
    }

    psramBusy = false;
    return false;
}

int pkgTxCount()
{
    int count = 0;
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            count++;
        }
    }
    return count;
}

bool pkgTxPush(const char *info, size_t len, int dly, uint8_t Ch)
{
    char *ecs = strstr(info, ">");
    if (ecs == NULL)
        return false;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    // for (int i = 0; i < PKGTXSIZE; i++)
    // {
    //   if (txQueue[i].Active)
    //   {
    //     if ((strncmp(&txQueue[i].Info[0], info, info - ecs)==0)) //Check src callsign
    //     {
    //       // strcpy(&txQueue[i].Info[0], info);
    //       memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
    //       memcpy(&txQueue[i].Info[0], info, len);
    //       txQueue[i].Delay = dly;
    //       txQueue[i].timeStamp = millis();
    //       psramBusy = false;
    //       return true;
    //     }
    //   }
    // }

    // Add
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active == false)
        {
            if (len > sizeof(txQueue[i].Info))
                len = sizeof(txQueue[i].Info);
            memset(txQueue[i].Info, 0, sizeof(txQueue[i].Info));
            memcpy(&txQueue[i].Info[0], info, len);
            txQueue[i].length = len;
            txQueue[i].Delay = dly;
            txQueue[i].Active = true;
            txQueue[i].timeStamp = millis();
            txQueue[i].Channel = Ch;
            break;
        }
    }
    psramBusy = false;
    return true;
}

bool pkgTxSend()
{
//   if (getReceive())
//     return false;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    // char info[300];
    for (int i = 0; i < PKGTXSIZE; i++)
    {
        if (txQueue[i].Active)
        {
            int decTime = millis() - txQueue[i].timeStamp;
            if (txQueue[i].Channel & INET_CHANNEL)
            {
                if (config.igate_en == false)
                {
                    txQueue[i].Channel &= ~INET_CHANNEL;
                }
                else
                {
                    if (aprsClient.connected())
                    {
                        // status.txCount++;
                        // aprsClient.printf("%s\r\n", txQueue[i].Info); // Send packet to Inet
                        aprsClient.write(txQueue[i].Info, txQueue[i].length); // Send binary frame packet to APRS-IS (aprsc)
                        aprsClient.write("\r\n");                             // Send CR LF the end frame packet
                        txQueue[i].Channel &= ~INET_CHANNEL;
                        log_d("TX->INET: %s", txQueue[i].Info);
                        continue;
                    }
                }
            }
            if (decTime > txQueue[i].Delay)
            {
                if (txQueue[i].Channel & RF_CHANNEL)
                {

                    psramBusy = false;
                    if(config.rf_en){
                        if ((config.rf_type == RF_SR_1WV) || (config.rf_type == RF_SR_1WU) || (config.rf_type == RF_SR_1W350))
                        {
                            digitalWrite(config.rf_pwr_gpio, LOW);
                            if (config.rf_power ^ !config.rf_pwr_active)
                                pinMode(config.rf_pwr_gpio, OPEN_DRAIN);
                            else
                                pinMode(config.rf_pwr_gpio, OUTPUT);
                        }
                        else
                        {
                            digitalWrite(config.rf_pwr_gpio, config.rf_power ^ !config.rf_pwr_active); // ON RF Power H/L
                        }
                    }
                    status.txCount++;
                    log_d("TX->RF[%i]: %s\n", txQueue[i].length, txQueue[i].Info);
                    APRS_setPreamble(config.preamble * 100); // Send packet to RF
                    APRS_sendTNC2Pkt((uint8_t *)txQueue[i].Info, txQueue[i].length);
                    igateTLM.TX++;

                    // free(info);
                    //  for (int i = 0; i < 100; i++)
                    //  {
                    //      // if (digitalRead(config.rf_ptt_gpio) ^ config.rf_ptt_active)
                    //      if (!getTransmit())
                    //          break;
                    //      delay(50); // TOT 5sec
                    //  }
                    // digitalWrite(config.rf_pwr_gpio, !config.rf_pwr_active); // OFF RF Power H/L
                    // pinMode(config.rf_pwr_gpio, OUTPUT);
                    txQueue[i].Channel &= ~RF_CHANNEL;
                }
            }

            if ((txQueue[i].Channel == 0) || (decTime > 60000))
            {
                txQueue[i].Channel = 0;
                txQueue[i].Active = false;
            }
        }
    }
    psramBusy = false;
    return true;
}

uint8_t *packetData;
// ฟังชั่นถูกเรียกมาจาก ax25_decode
// uint8_t swap=0;
void aprs_msg_callback(struct AX25Msg *msg)
{
    AX25Msg pkg;

    memcpy(&pkg, msg, sizeof(AX25Msg));
    int timeout = 0;
    // while (PacketBuffer.isFull())
    // {
    //     log_d("PacketBuffer is Full!");
    //     delay(100);
    //     if (++timeout > 10)
    //         return;
    // }
    // if(++swap%3 == 0){
    // sprintf((char *)pkg.info,"`l-hl }>/`\"3q}144.937MHz Pirate Pilot on board!!!_%%");
    // pkg.len=52;
    // sprintf(pkg.src.call,"E25KFR");
    // pkg.src.ssid=9;
    // sprintf(pkg.dst.call,"QS4WU3");
    // pkg.dst.ssid=0;
    // pkg.rpt_count=1;
    // sprintf(pkg.rpt_list[0].call,"WIDE1");
    // pkg.rpt_list[0].ssid=1;
    // }

    // PacketBuffer.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
    status.rxCount++;
}

void printTime()
{
    struct tm tmstruct;
    getLocalTime(&tmstruct, 5000);
    // Serial.print("[");
    // Serial.print(tmstruct.tm_hour);
    // Serial.print(":");
    // Serial.print(tmstruct.tm_min);
    // Serial.print(":");
    // Serial.print(tmstruct.tm_sec);
    // Serial.print("]");
}

uint8_t gwRaw[PKGLISTSIZE][66];
uint8_t gwRawSize[PKGLISTSIZE];
int gwRaw_count = 0, gwRaw_idx_rd = 0, gwRaw_idx_rw = 0;

void pushGwRaw(uint8_t *raw, uint8_t size)
{
    if (gwRaw_count > PKGLISTSIZE)
        return;
    if (++gwRaw_idx_rw >= PKGLISTSIZE)
        gwRaw_idx_rw = 0;
    if (size > 65)
        size = 65;
    memcpy(&gwRaw[gwRaw_idx_rw][0], raw, size);
    gwRawSize[gwRaw_idx_rw] = size;
    gwRaw_count++;
}

