nakhonthai/ESP32APRS_Audio/src/main.cpp
boolean APRSConnect()
{
    // Serial.println("Connect TCP Server");
    String login = "";
    int cnt = 0;
    uint8_t con = aprsClient.connected();
    // Serial.println(con);
    if (con <= 0)
    {
        if (!aprsClient.connect(config.aprs_host, config.aprs_port)) // เชื่อมต่อกับเซิร์ฟเวอร์ TCP
        {
            // Serial.print(".");
            delay(1000);
            cnt++;
            if (cnt > 3) // วนร้องขอการเชื่อมต่อ 50 ครั้ง ถ้าไม่ได้ให้รีเทิร์นฟังค์ชั่นเป็น False
                return false;
        }
        // ขอเชื่อมต่อกับ aprsc
        if (strlen(config.igate_object) >= 3)
        {
            uint16_t passcode = aprsParse.passCode(config.igate_object);
            login = "user " + String(config.igate_object) + " pass " + String(passcode, DEC) + " vers ESP32APRS_Audio V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
        }
        else
        {
            uint16_t passcode = aprsParse.passCode(config.aprs_mycall);
            if (config.aprs_ssid == 0)
                login = "user " + String(config.aprs_mycall) + " pass " + String(passcode, DEC) + " vers ESP32APRS_Audio V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
            else
                login = "user " + String(config.aprs_mycall) + "-" + String(config.aprs_ssid) + " pass " + String(passcode, DEC) + " vers ESP32APRS_Audio V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
        }
        aprsClient.println(login);
        // Serial.println(login);
        // Serial.println("Success");
        delay(500);
    }
    return true;
}

long oledSleepTimeout = 0;
bool showDisp = false;
RTC_DATA_ATTR uint8_t curTab;

void preTransmission()
{
    digitalWrite(config.modbus_de_gpio, 1);
}

void postTransmission()
{
    digitalWrite(config.modbus_de_gpio, 0);
}

#ifdef BLUETOOTH
void bluetooth_init()
{
    if (config.bt_master == true)
    {
#if !defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32C6)
        // Initialize BLE stack and Nordic UART service
        NimBLEDevice::init(config.bt_name);
        NimBLEDevice::getAdvertising()->setName(config.bt_name);
        // BLE Auth
        if (config.bt_pin > 0)
        {
            NimBLEDevice::setSecurityAuth(true, true, true); /** bonding, MITM, BLE secure connections */
            NimBLEDevice::setSecurityPasskey(config.bt_pin);
            NimBLEDevice::setSecurityIOCap(BLE_HS_IO_DISPLAY_ONLY); /** Display only passkey */
            log_d("Bluetooth Security: Passkey %d", config.bt_pin);
        }
        NuSerial.begin_uuid(config.bt_uuid, config.bt_uuid_tx, config.bt_uuid_rx, 115200);
#else
#endif
    }
}
#endif

// 3 seconds WDT
#define WDT_TIMEOUT 10

bool AFSKInitAct = false;
void setup()
{
    //byte *ptr;
    // setCpuFrequencyMhz(160);
#ifdef BOARD_HAS_PSRAM
    pkgList = (pkgListType *)ps_malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)ps_malloc(sizeof(txQueueType) * PKGTXSIZE);
    // TNC2Raw = (int *)ps_malloc(sizeof(int) * PKGTXSIZE);
#else
    pkgList = (pkgListType *)malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)malloc(sizeof(txQueueType) * PKGTXSIZE);
    // TNC2Raw = (int *)malloc(sizeof(int) * PKGTXSIZE);
#endif

    memset(pkgList, 0, sizeof(pkgListType) * PKGLISTSIZE);
    memset(Telemetry, 0, sizeof(TelemetryType) * TLMLISTSIZE);
    memset(txQueue, 0, sizeof(txQueueType) * PKGTXSIZE);

    pinMode(BOOT_PIN, INPUT_PULLUP); // BOOT Button
    pinMode(LED_RX, OUTPUT);
    pinMode(LED_TX, OUTPUT);

    // Set up serial port
#ifdef CORE_DEBUG_LEVEL
    Serial.begin(115200); // debug
#else
    Serial.begin(9600); // monitor
#endif

    if (!LITTLEFS.begin(FORMAT_LITTLEFS_IF_FAILED))
    {
        log_d("LITTLEFS Mount Failed");
        // return;
    }
    else
    {
        log_d("File system mounted");
        log_d("Total space: %lu\n", LITTLEFS.totalBytes());
        log_d("Use space:  %lu\n\n", LITTLEFS.usedBytes());
    }

    Serial.println();
    Serial.println("Start ESP32APRS_Audio V" + String(VERSION));
    Serial.println("Push BOOT after 3 sec for Factory Default config.");

    // if (!EEPROM.begin(EEPROM_SIZE))
    // {
    //     Serial.println(F("failed to initialise EEPROM")); // delay(100000);
    // }
    // // ตรวจสอบคอนฟิกซ์ผิดพลาด
    // ptr = (byte *)&config;
    // EEPROM.readBytes(1, ptr, sizeof(Configuration));
    // uint8_t chkSum = checkSum(ptr, sizeof(Configuration));
    // Serial.printf("EEPROM Check %0Xh=%0Xh(%dByte)\n", EEPROM.read(0), chkSum, sizeof(Configuration));
    // if (EEPROM.read(0) != chkSum)
    // {
    //     Serial.println("CFG EEPROM Error!");
    //     Serial.println("Factory Default");
    //     defaultConfig();
    // }
    #ifdef STRIP_PIN
    strip = new Adafruit_NeoPixel(1, STRIP_PIN, NEO_GRB + NEO_KHZ800);    
    #endif

    LED_Status(255,255,255);

    if (!LITTLEFS.exists("/default.cfg"))
    {
        log_d("Factory Default");
        defaultConfig();
        saveConfiguration("/default.cfg", config);
    }
    else
    {
        if (!loadConfiguration("/default.cfg", config))
            defaultConfig();
    }

    LED_Status(255,255,255);

    #if defined(CONFIG_IDF_TARGET_ESP32S3)
    if((config.rf_ptt_gpio > 25) && (config.rf_ptt_gpio < 38))
      config.rf_ptt_gpio = 5; // GPIO25-37 are flash only on ESP32S3
    #endif

    if (config.i2c1_enable)
    {
        Wire1.begin(config.i2c1_sda_pin, config.i2c1_sck_pin, config.i2c1_freq);
    }

#ifdef OLED
        if (config.oled_enable)
        {
            i2c_busy = true;
            Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);
// by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
// display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false); // initialize with the I2C addr 0x3C (for the 128x64)
#ifdef SH1106
            display.begin(SH1106_SWITCHCAPVCC, SCREEN_ADDRESS, OLED_RESET > -1);
#else
            display.begin(SSD1306_SWITCHCAPVCC, SCREEN_ADDRESS, OLED_RESET > -1, false);
#endif
            // Initialising the UI will init the display too.
            display.clearDisplay();
            display.setTextSize(1);
            display.setTextColor(WHITE);

