nakhonthai/ESP32APRS_Audio/src/main.cpp
        LastLat = nowLat;
        LastLng = nowLng;
        lastTimeStamp = nowTime;

        if (config.trk_compress)
        { // Compress DATA

            // String compPosition = compress_position(nowLat, nowLng, gps.altitude.feet(), course, spdKnot, aprs_table, aprs_symbol, (gps.satellites.value() > 3));
            //  ESP_LOGE("GPS", "Compress=%s", aprs_position);
            if ((strlen(config.trk_item) >= 3) || (config.trk_timestamp))
            {
                String compPosition = compress_position(nowLat, nowLng, gps.altitude.feet(), course, spdKnot, aprs_table, aprs_symbol, (gps.satellites.value() > 3));
                char object[10];
                memset(object, 0x20, 10);
                memcpy(object, config.trk_item, strlen(config.trk_item));
                object[9] = 0;
                if (config.trk_timestamp)
                {
                    String timeStamp = getTimeStamp();
                    sprintf(rawTNC, ";%s*%s%s", object, timeStamp, compPosition.c_str());
                }
                else
                {
                    sprintf(rawTNC, ")%s!%s", config.trk_item, compPosition.c_str());
                }
            }
            else
            {
                char destCallsign[8];
                String compPosition = compressMicE(destCallsign, nowLat, nowLng, (uint16_t)course, spdKnot, config.trk_mice_type, NULL, 0, NULL, NULL, (int32_t)gps.altitude.meters(), aprs_table, aprs_symbol);
                String tnc2Raw = "";
                char *strtmp = (char *)calloc(300, sizeof(char));
                if (strtmp)
                {
                    memset(strtmp, 0, 300);
                    if (config.trk_ssid == 0)
                        sprintf(strtmp, "%s>%s", config.trk_mycall, destCallsign);
                    else
                        sprintf(strtmp, "%s-%d>%s", config.trk_mycall, config.trk_ssid, destCallsign);
                    tnc2Raw = String(strtmp);
                    free(strtmp);
                }
                if (config.trk_path < 5)
                {
                    if (config.trk_path > 0)
                        tnc2Raw += "-" + String(config.trk_path);
                }
                else
                {
                    tnc2Raw += ",";
                    tnc2Raw += getPath(config.trk_path);
                }
                tnc2Raw += ":";
                tnc2Raw += String(compPosition);
                tnc2Raw += comment + String(config.trk_comment);
                return tnc2Raw;
            }
        }
        else
        { // None compress DATA
            int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
            char lon_ew = 'E';
            char lat_ns = 'N';
            if (nowLat < 0)
                lat_ns = 'S';
            if (nowLng < 0)
                lon_ew = 'W';
            DD_DDDDDtoDDMMSS(nowLat, &lat_dd, &lat_mm, &lat_ss);
            DD_DDDDDtoDDMMSS(nowLng, &lon_dd, &lon_mm, &lon_ss);
            char csd_spd[8];
            memset(csd_spd, 0, sizeof(csd_spd));
            sprintf(csd_spd, "%03d/%03d", (int)gps.course.deg(), (int)gps.speed.knots());
            if (strlen(config.trk_item) >= 3)
            {
                char object[10];
                memset(object, 0x20, 10);
                memcpy(object, config.trk_item, strlen(config.trk_item));
                object[9] = 0;
                if (config.trk_timestamp)
                {
                    String timeStamp = getTimeStamp();
                    sprintf(rawTNC, ";%s*%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", object, timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
                }
                else
                {
                    sprintf(rawTNC, ")%s!%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", config.trk_item, lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
                }
            }
            else
            {
                if (config.trk_timestamp)
                {
                    String timeStamp = getTimeStamp();
                    sprintf(rawTNC, "/%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
                }
                else
                {
                    sprintf(rawTNC, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
                }
            }
            if (config.trk_altitude)
            {

                if (gps.altitude.isValid())
                {
                    char strAltitude[10];
                    memset(strAltitude, 0, sizeof(strAltitude));
                    sprintf(strAltitude, "/A=%06d", (int)gps.altitude.feet());
                    strcat(rawTNC, strAltitude);
                }
            }
        }
    }
    else
    {
        sprintf(rawTNC, ">%s ", config.trk_item);
    }

    String tnc2Raw = "";
    char *strtmp = (char *)calloc(300, sizeof(char));
    if (strtmp)
    {
        memset(strtmp, 0, 300);
        if (config.trk_ssid == 0)
            sprintf(strtmp, "%s>APE32A", config.trk_mycall);
        else
            sprintf(strtmp, "%s-%d>APE32A", config.trk_mycall, config.trk_ssid);
        tnc2Raw = String(strtmp);
        free(strtmp);
    }
    if (config.trk_path < 5)
    {
        if (config.trk_path > 0)
            tnc2Raw += "-" + String(config.trk_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.trk_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(rawTNC);
    tnc2Raw += comment + String(config.trk_comment);
    return tnc2Raw;
}

String trk_fix_position(String comment)
{
    char loc[100];
    String tnc2Raw = "";
    memset(loc, 0, sizeof(loc));
    if (config.trk_compress)
    { // Compress DATA

        String compPosition = compress_position(config.trk_lat, config.trk_lon, (int)(config.trk_alt * 3.28F), 0, 0, config.trk_symbol[0], config.trk_symbol[1], true);
        // ESP_LOGE("GPS", "Compress=%s", aprs_position);
        if (strlen(config.trk_item) >= 3)
        {
            char object[10];
            memset(object, 0x20, 10);
            memcpy(object, config.trk_item, strlen(config.trk_item));
            object[9] = 0;
            if (config.trk_timestamp)
            {
                String timeStamp = getTimeStamp();
                sprintf(loc, ";%s*%s%s", object, timeStamp, compPosition.c_str());
            }
            else
            {
                sprintf(loc, ")%s!%s", config.trk_item, compPosition.c_str());
            }
        }
        else
        {
            if (config.trk_timestamp)
            {
                String timeStamp = getTimeStamp();
                sprintf(loc, "/%s%s", timeStamp, compPosition.c_str());
            }
            else
            {
                sprintf(loc, "!%s", compPosition.c_str());
            }
        }
    }
    else
    {
        int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;

        char lon_ew = 'E';
        char lat_ns = 'N';
        if (config.trk_lat < 0)
            lat_ns = 'S';
        if (config.trk_lon < 0)
            lon_ew = 'W';

        DD_DDDDDtoDDMMSS(config.trk_lat, &lat_dd, &lat_mm, &lat_ss);
        DD_DDDDDtoDDMMSS(config.trk_lon, &lon_dd, &lon_mm, &lon_ss);

