nakhonthai/ESP32APRS_Audio/src/main.cpp
                            String src_call = raw.substring(0, raw.indexOf('>'));
                            if ((src_call != "") && (src_call.length() < 11) && (raw.length() < sizeof(rawP)))
                            {
                                memset(call, 0, sizeof(call));
                                strcpy(call, src_call.c_str());
                                memset(rawP, 0, sizeof(rawP));
                                strcpy(rawP, raw.c_str());
                                log_d("Yaesu Packet: CallSign:%s RAW:%s", call, rawP);
                                // String hstr="";
                                // for(int i=0;i<raw.length();i++){
                                //     hstr+=" "+String(rawP[i],HEX);
                                // }
                                // log_d("HEX: %s",hstr.c_str());
                                uint16_t type = pkgType((const char *)rawP);
                                pkgListUpdate(call, rawP, type, 1, 0);
                                if (config.rf2inet && aprsClient.connected())
                                {
                                    // RF->INET
                                    aprsClient.write(&rawP[0], strlen(rawP)); // Send binary frame packet to APRS-IS (aprsc)
                                    aprsClient.write("\r\n");                 // Send CR LF the end frame packet
                                    // status.rf2inet++;
                                    // igateTLM.RF2INET++;
                                    igateTLM.RX++;
                                }
                            }
                        }
                    }
                }
            }
            //}
        }
    }
}

long timeSlot;
unsigned long iGatetickInterval;
unsigned long WxInterval;
bool initInterval = true;
int trkTlmInvCount = 0;
int igateTlmInvCount = 0;
int digiTlmInvCount = 0;
void taskAPRS(void *pvParameters)
{
    //	long start, stop;
    char sts[50];
    unsigned long tickInterval = 0;
    unsigned long DiGiInterval = 0;

    unsigned long igateSTSInterval = 0;
    unsigned long digiSTSInterval = 0;
    unsigned long trkSTSInterval = 0;

    uint16_t type = 0;
    bool newIGatePkg = false;
    bool newDigiPkg = false;
    uint8_t *buf;
    uint16_t size = 0;
    int8_t peak = 0;
    int8_t valley = 0;
    uint8_t signalLevel = 0;
    uint8_t fixed = 0;
    uint16_t mV = 0;

    
    // PacketBuffer.clean();
    adcEn = 0;
    dacEn = 0;

    APRS_setCallsign(config.aprs_mycall, config.aprs_ssid);
    sendTimer = millis() - (config.igate_interval * 1000) + 30000;
    igateTLM.TeleTimeout = millis() + 60000; // 1Min

    timeSlot = millis();
    timeAprs = 0;
    tx_interval = config.trk_interval;
    tx_counter = tx_interval - 10;

    initInterval = true;
    AFSKInitAct = true;
    log_d("Task APRS has been start");
    for (;;)
    {

        // if (adcEn == 1)
        // {
        //     AFSK_TimerEnable(true);
        //     adcEn = 0;
        // }
        // else if (adcEn == -1)
        // {
        //     AFSK_TimerEnable(false);
        //     adcEn = 0;
        // }

        if (dacEn == 1)
        {
            DAC_TimerEnable(true);
            dacEn = 0;
        }
        else if (dacEn == -1)
        {
            DAC_TimerEnable(false);
            dacEn = 0;
        }
        long now = millis();
        // wdtSensorTimer = now;
        // time_t timeStamp;
        // time(&timeStamp);
        if (initInterval)
        {
            tickInterval = WxInterval = DiGiInterval = igateSTSInterval = iGatetickInterval = digiSTSInterval = trkSTSInterval = millis() + 10000;
            systemTLM.ParmTimeout = millis() + 20000;
            systemTLM.TeleTimeout = millis() + 30000;
            initInterval = false;
            tx_interval = config.trk_interval;
            tx_counter = tx_interval - 10;
        }
        timerAPRS = micros() - timerAPRS_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);
        timerAPRS_old = micros();

#ifdef BLUETOOTH
#if !defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32C6)
        if (NuSerial.isConnected())
        {
            if (NuSerial.available())
            {
                log_d("Bluetooth RX Data: %d Byte", NuSerial.available());
                if (config.bt_mode == 1)
                { // TNC2RAW MODE
                    String rxValue = NuSerial.readString();
                    uint8_t SendMode = TNC_CHANNEL;
                    if (config.igate_loc2rf)
                        SendMode |= RF_CHANNEL;
                    if (config.igate_loc2inet)
                        SendMode |= INET_CHANNEL;
                    pkgTxPush(rxValue.c_str(), rxValue.length(), 1, SendMode);
                }
                else if (config.bt_mode == 2)
                {
                    // KISS MODE
                    size_t num = NuSerial.available();
                    for (int i = 0; i < num; i++)
                    {
                        kiss_serial((uint8_t)NuSerial.read());
                    }
                }
            }
        }
#else
        if (SerialBT.available())
        {
            log_d("Bluetooth RX Data: %d Byte", SerialBT.available());
            if (config.bt_mode == 1)
            { // TNC2RAW MODE
                String rxValue = SerialBT.readString();
                uint8_t SendMode = TNC_CHANNEL;
                if (config.igate_loc2rf)
                    SendMode |= RF_CHANNEL;
                if (config.igate_loc2inet)
                    SendMode |= INET_CHANNEL;
                pkgTxPush(rxValue.c_str(), rxValue.length(), 1, SendMode);
            }
            else if (config.bt_mode == 2)
            {
                // KISS MODE
                size_t num = SerialBT.available();
                for (int i = 0; i < num; i++)
                {
                    kiss_serial((uint8_t)SerialBT.read());
                }
            }
        }
#endif
#endif

        // SEND RF in time slot
        // if (now > timeSlot)
        // {
        // Transmit in timeslot if enabled
        pkgTxSend();
        //     timeSlot = millis() + 100;
        // }
        Ax25TransmitBuffer(); // transmit buffer (will return if nothing to be transmitted)
        Ax25TransmitCheck();  // check for pending transmission request

        if (config.trk_en)
        { // TRACKER MODE
            if (config.trk_sts_interval > 10)
            {
                if (millis() > trkSTSInterval)
                {
                    trkSTSInterval = millis() + (config.trk_sts_interval * 1000);
                    tracker_status(config.trk_status);
                }
            }
            if (millis() > tickInterval)
            {
                tickInterval = millis() + 1000;

                tx_counter++;
                // log_d("TRACKER tx_counter=%d\t INTERVAL=%d\n", tx_counter, tx_interval);
                //   Check interval timeout
                if (config.trk_smartbeacon && config.trk_gps)
                {
                    if ((gps.satellites.value() > 3) && (gps.hdop.hdop() < 10))
                    {
                        if (tx_counter > tx_interval)
                        {
                            if (tx_counter > config.trk_mininterval)
                                EVENT_TX_POSITION = 4;
                        }
                        else
                        {
                            if (tx_counter >= (tx_interval + 5))
                            {
                                EVENT_TX_POSITION = 5;
                            }
                        }
                    }
                }
                else if (tx_counter > tx_interval)
                {
                    // if (tx_counter > config.trk_slowinterval)
                    //{
                    EVENT_TX_POSITION = 6;
                    tx_interval = config.trk_interval;
                    //}
                }

                // if (config.trk_gps && gps.speed.isValid() && gps.location.isValid() && gps.course.isValid() && (gps.hdop.hdop() < 10.0) && (gps.satellites.value() > 3))
                // if (config.trk_gps && gps.speed.isValid() && gps.location.isValid() && gps.course.isValid())
                if (config.trk_gps)
                {
                    SB_SPEED_OLD = SB_SPEED;
                    if (gps.satellites.value() > 3 && gps.hdop.hdop() < 10)
                    {
                        SB_SPEED = (unsigned char)gps.speed.kmph();
                        // if (gps.course.isUpdated())
                        if (gps.speed.kmph() > config.trk_lspeed)
                            SB_HEADING = (int16_t)gps.course.deg();
                    }
                    else
                    {
                        if (SB_SPEED > 0)
                            SB_SPEED--;
                    }
                    if (config.trk_smartbeacon) // SMART BEACON CAL
                    {
                        if (SB_SPEED < config.trk_lspeed && SB_SPEED_OLD > config.trk_lspeed) // Speed slow down to STOP
                        {                                                                     // STOPING
                            SB_SPEED_OLD = 0;
                            if (tx_counter > config.trk_mininterval)
                            {
                                EVENT_TX_POSITION = 7;
                                tx_interval = config.trk_slowinterval;
                            }
                        }
                        else
                        {
                            smartbeacon();
                        }
                    }
                    else if (tx_counter > tx_interval)
                    { // send gps location
                        if (gps.location.isValid() && gps.hdop.hdop() < 10)
                        {
                            EVENT_TX_POSITION = 8;
                            tx_interval = config.trk_interval;
                        }
                    }
                }
            }

            if (EVENT_TX_POSITION > 0)
            {
                String rawData;
                String cmn = "";
                Sleep_Activate &= ~ACTIVATE_TRACKER;
                StandByTick = millis() + (5000);
                if (config.trk_tlm_interval > 0)
                {
                    trkTlmInvCount++;
                    if (trkTlmInvCount >= config.trk_tlm_interval)
                    {
                        trkTlmInvCount = 0;
                        if (config.trk_tlm_sensor[0] | config.trk_tlm_sensor[1] | config.trk_tlm_sensor[2] | config.trk_tlm_sensor[3] | config.trk_tlm_sensor[4])
                        {
                            char tlm_result[100];
                            char tlm_data[200];
                            size_t tlm_sz;
                            if ((TLM_SEQ % 100) == 0)
                            {
                                char rawInfo[100];
                                char name[10];
                                sprintf(rawInfo, "PARM.");
                                int i, c = 0;
                                for (i = 0; i < 5; i++)
                                {
                                    if (config.trk_tlm_sensor[i] == 0)
                                    {
                                        c++;
                                        continue;
                                    }
                                    else
                                    {
                                        if (i > 0)
                                            strcat(rawInfo, ",");
                                        sprintf(name, "%s", config.trk_tlm_PARM[i]);
                                        strcat(rawInfo, name);
                                    }
                                }
                                for (int n = c + 8; n > 0; n--)
                                {
                                    strcat(rawInfo, ",");
                                }
                                sendTelemetry_trk(rawInfo);
                                memset(rawInfo, 0, sizeof(rawInfo));
                                sprintf(rawInfo, "UNIT.");
                                c = 0;
                                for (i = 0; i < 5; i++)
                                {
                                    if (config.trk_tlm_sensor[i] == 0)
                                    {
                                        c++;
                                        continue;
                                    }
                                    else
                                    {
                                        if (i > 0)
                                            strcat(rawInfo, ",");
                                        sprintf(name, "%s", config.trk_tlm_UNIT[i]);
                                        strcat(rawInfo, name);
                                    }
                                }
                                for (int n = c + 8; n > 0; n--)
                                {
                                    strcat(rawInfo, ",");
                                }
                                sendTelemetry_trk(rawInfo);
                                memset(rawInfo, 0, sizeof(rawInfo));
                                sprintf(rawInfo, "EQNS.");
                                c = 0;
                                for (i = 0; i < 5; i++)
                                {
                                    if (config.trk_tlm_sensor[i] == 0)
                                    {
                                        c++;
                                        continue;
                                    }
                                    else
                                    {
                                        if (i > 0)
                                            strcat(rawInfo, ",");
                                        if (fmod(config.trk_tlm_EQNS[i][0], 1) == 0)
                                            sprintf(name, "%0.f", config.trk_tlm_EQNS[i][0]);
                                        else
                                            sprintf(name, "%.3f", config.trk_tlm_EQNS[i][0]);
                                        strcat(rawInfo, name);
                                        if (fmod(config.trk_tlm_EQNS[i][1], 1) == 0)
                                            sprintf(name, ",%0.f", config.trk_tlm_EQNS[i][1]);
                                        else
                                            sprintf(name, ",%.3f", config.trk_tlm_EQNS[i][1]);
                                        strcat(rawInfo, name);
                                        if (fmod(config.trk_tlm_EQNS[i][2], 1) == 0)
                                            sprintf(name, ",%0.f", config.trk_tlm_EQNS[i][2]);
                                        else
                                            sprintf(name, ",%.3f", config.trk_tlm_EQNS[i][2]);
                                        strcat(rawInfo, name);
                                    }
                                }
                                for (int n = c; n > 0; n--)
                                {
                                    strcat(rawInfo, ",");
                                    sprintf(name, "0");
                                    strcat(rawInfo, name);
                                    sprintf(name, ",1");
                                    strcat(rawInfo, name);
                                    sprintf(name, ",0");
                                    strcat(rawInfo, name);
                                }
                                // strcat(rawInfo, ",");
                                sendTelemetry_trk(rawInfo);
                            }

                            if (++TLM_SEQ > 8279)
                                TLM_SEQ = 0;
                            memset(tlm_data, 0, 200);
                            memset(tlm_result, 0, 100);
                            int n = 0;
                            sprintf(tlm_data, "%i", TLM_SEQ);
                            for (int s = 0; s < 5; s++)
                            {
                                if (config.trk_tlm_sensor[s] == 0)
                                {
                                    continue;
                                    // strcat(tlm_data, "0");
                                }
                                else
                                {
                                    strcat(tlm_data, ",");
                                    int sen_idx = config.trk_tlm_sensor[s] - 1;
                                    double data = 0;
                                    if (sen[sen_idx].visable)
                                        data = sen[sen_idx].sample;
                                    double precision = pow(10.0f, (double)config.trk_tlm_precision[s]);
                                    int val = (int)((data + config.trk_tlm_offset[s]) * precision);
                                    // log_d("s:%d Data:%.2f /tPresion:%.5f /tOffset:%.5f/t Val:%d",s,sen[sen_idx].sample,precision,config.trk_tlm_offset[s],val);
                                    if (val > 8280)
                                        val = 8280;
                                    if (val < 0)
                                        val = 0;
                                    char strVal[10];
                                    sprintf(strVal, "%i", val);
                                    strcat(tlm_data, strVal);
                                }
                            }
                            // log_d("TLM_DATA:%s",tlm_data);
                            //  sprintf(tlm_data, "%i,%i,%i,%i", TLM_SEQ, (int)(VBat * 100), int(TempNTC * 100), gps.satellites.value());
                            telemetry_base91(tlm_data, tlm_result, tlm_sz);
                            cmn = String(tlm_result);
                        }
                    }
                }

