nakhonthai/ESP32APRS_Audio/src/main.cpp
                                    if (++IGATE_TLM_SEQ > 8279)
                                        IGATE_TLM_SEQ = 0;
                                    memset(tlm_data, 0, 200);
                                    memset(tlm_result, 0, 100);
                                    int n = 0;
                                    sprintf(tlm_data, "%i", IGATE_TLM_SEQ);
                                    for (int s = 0; s < 5; s++)
                                    {
                                        if (config.igate_tlm_sensor[s] == 0)
                                        {
                                            continue;
                                            // strcat(tlm_data, "0");
                                        }
                                        else
                                        {
                                            strcat(tlm_data, ",");
                                            int sen_idx = config.igate_tlm_sensor[s] - 1;
                                            double data = 0;
                                            if (sen[sen_idx].visable)
                                                data = sen[sen_idx].sample;
                                            double precision = pow(10.0f, (double)config.igate_tlm_precision[s]);
                                            int val = (int)((data + config.igate_tlm_offset[s]) * precision);
                                            // log_d("s:%d Data:%.2f /tPresion:%.5f /tOffset:%.5f/t Val:%d",s,sen[sen_idx].sample,precision,config.trk_tlm_offset[s],val);
                                            if (val > 8280)
                                                val = 8280;
                                            if (val < 0)
                                                val = 0;
                                            char strVal[10];
                                            sprintf(strVal, "%i", val);
                                            strcat(tlm_data, strVal);
                                        }
                                    }
                                    // log_d("TLM_DATA:%s",tlm_data);
                                    //  sprintf(tlm_data, "%i,%i,%i,%i", TLM_SEQ, (int)(VBat * 100), int(TempNTC * 100), gps.satellites.value());
                                    telemetry_base91(tlm_data, tlm_result, tlm_sz);
                                    rawData += String(tlm_result);
                                }
                            }
                        }
                        if (strlen(config.igate_comment) > 0)
                        {
                            rawData += String(config.igate_comment);
                        }

                        log_d("IGATE_POSITION: %s", rawData.c_str());

                        if (config.igate_gps)
                            sprintf(sts, "POSITION GPS\nINTERVAL %ds", tx_interval);
                        else
                            sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);

                        uint8_t SendMode = 0;
                        if (config.igate_loc2rf)
                            SendMode |= RF_CHANNEL;
                        if (config.igate_loc2inet)
                            SendMode |= INET_CHANNEL;
                        pkgTxPush(rawData.c_str(), rawData.length(), 0, SendMode);
//                         if (config.igate_loc2rf)
//                         { // IGATE SEND POSITION TO RF
//                             char *rawP = (char *)calloc(rawData.length(), sizeof(char));
//                             // rawData.toCharArray(rawP, rawData.length());
//                             memcpy(rawP, rawData.c_str(), rawData.length());
//                             pkgTxPush(rawP, rawData.length(), 0);
#if defined OLED || defined ST7735_160x80
                       if(config.oled_enable) pushTxDisp(TXCH_RF, "TX IGATE", sts);
#endif
                        //                             free(rawP);
                        //                         }
                        //                         if (config.igate_loc2inet)
                        //                         { // IGATE SEND TO APRS-IS
                        //                             if (aprsClient.connected())
                        //                             {
                        //                                 status.txCount++;
                        //                                 aprsClient.println(rawData); // Send packet to Inet
                        // #if defined OLED || defined ST7735_160x80
                        //                                 pushTxDisp(TXCH_TCP, "TX IGATE", sts);
                        // #endif
                        //                             }
                        //                         }
                    }
                }
            }
            // IGATE send to inet
            if (newIGatePkg)
            {
                newIGatePkg = false;
                // if (config.rf2inet && aprsClient.connected())
                if (config.rf2inet)
                {
                    int ret = 0;
                    // uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
                    //  IGate Filter RF->INET
                    if ((type & config.rf2inetFilter))
                        ret = igateProcess(incomingPacket);
                    if (ret == 0)
                    {
                        status.dropCount++;
                        igateTLM.DROP++;
                    }
                    else
                    {
                        status.rf2inet++;
                        igateTLM.RF2INET++;
                        igateTLM.TX++;
                    }
                }
            }
        }

        // Digi Repeater Process
        if (config.digi_en || (config.digi_auto && (aprsClient.connected() == false)))
        {
            if (config.digi_sts_interval > 10)
            {
                if (millis() > digiSTSInterval)
                {
                    digiSTSInterval = millis() + (config.digi_sts_interval * 1000);
                    digi_status(config.digi_status);
                }
            }
            // DIGI Position
            if (config.digi_bcn)
            {
                if (millis() > DiGiInterval)
                {

