nakhonthai/ESP32APRS_Audio/src/main.cpp
                        log_d("DIGI_POSITION: %s", rawData.c_str());

                        if (config.digi_gps)
                            sprintf(sts, "POSITION GPS\nINTERVAL %ds", tx_interval);
                        else
                            sprintf(sts, "POSITION FIX\nINTERVAL %ds", tx_interval);

                        uint8_t SendMode = 0;
                        if (config.digi_loc2rf)
                            SendMode |= RF_CHANNEL;
                        if (config.digi_loc2inet)
                            SendMode |= INET_CHANNEL;
                        pkgTxPush(rawData.c_str(), rawData.length(), 0, SendMode);
//                         if (config.digi_loc2rf)
//                         { // DIGI SEND POSITION TO RF
//                             char *rawP = (char *)calloc(rawData.length(), sizeof(char));
//                             // rawData.toCharArray(rawP, rawData.length());
//                             memcpy(rawP, rawData.c_str(), rawData.length());
//                             pkgTxPush(rawP, rawData.length(), 0);
#if defined OLED || defined ST7735_160x80
                        if(config.oled_enable) pushTxDisp(TXCH_RF, "TX DIGI POS", sts);
#endif
                        //                             free(rawP);
                        //                         }
                        //                         if (config.digi_loc2inet)
                        //                         { // DIGI SEND TO APRS-IS
                        //                             if (aprsClient.connected())
                        //                             {
                        //                                 status.txCount++;
                        //                                 aprsClient.println(rawData); // Send packet to Inet
                        // #if defined OLED || defined ST7735_160x80
                        //                                 pushTxDisp(TXCH_TCP, "TX DIGI POS", sts);
                        // #endif
                        //                             }
                        //                         }
                    }
                    rawData.clear();
                }
            }

            // Repeater packet
            if (newDigiPkg)
            {
                newDigiPkg = false;
                // uint16_t type = pkgType((const char *)&incomingPacket.info[0]);
                Sleep_Activate &= ~ACTIVATE_DIGI;
                StandByTick = millis() + (config.pwr_stanby_delay * 1000);
                // Digi repeater filter
                if ((type & config.digiFilter))
                {
                    // Packet recheck
                    pkgTxDuplicate(incomingPacket); // Search duplicate in tx and drop packet for renew
                    int dlyFlag = digiProcess(incomingPacket);
                    if (dlyFlag > 0)
                    {
                        int digiDelay;
                        status.digiCount++;
                        if (dlyFlag == 1)
                        {
                            digiDelay = 0;
                        }
                        else
                        {
                            if (config.digi_delay == 0)
                            { // Auto mode
                              // if (digiCount > 20)
                              //   digiDelay = random(5000);
                              // else if (digiCount > 10)
                              //   digiDelay = random(3000);
                              // else if (digiCount > 0)
                              //   digiDelay = random(1500);
                              // else
                                digiDelay = random(100);
                            }
                            else
                            {
                                digiDelay = random(config.digi_delay);
                            }
                        }

                        String digiPkg;
                        packet2Raw(digiPkg, incomingPacket);
                        log_d("DIGI_REPEAT: %s", digiPkg.c_str());
                        log_d("DIGI delay=%d ms.", digiDelay);
                        // char *rawP = (char *)calloc(digiPkg.length()+1, sizeof(char));
                        //  digiPkg.toCharArray(rawP, digiPkg.length());
                        // memcpy(rawP, digiPkg.c_str(), digiPkg.length());
                        pkgTxPush(digiPkg.c_str(), digiPkg.length(), digiDelay, RF_CHANNEL);
                        digiPkg.clear();
                        // pkgTxPush(rawP, digiPkg.length(), digiDelay, RF_CHANNEL);
                        sprintf(sts, "--src call--\n%s\nDelay: %dms.", incomingPacket.src.call, digiDelay);
#if defined OLED || defined ST7735_160x80
                        if(config.oled_enable) pushTxDisp(TXCH_DIGI, "DIGI REPEAT", sts);
#endif
                        // free(rawP);
                    }
                }
            }
        }

        // Weather
        if (config.wx_en)
        {
            if (millis() > WxInterval)
            {

                String rawData = "";
                if (config.wx_gps)
                { // Wx Send GPS position
                    if (gps.location.isValid())
                    {
                        rawData = wx_report(gps.location.lat(), gps.location.lng(), gps.altitude.meters(), "");
                        if (config.log & LOG_WX)
                        {
                            logWeather(gps.location.lat(), gps.location.lng(), gps.speed.kmph(), gps.course.deg());
                        }
                    }
                }
                else
                { // Wx Send fix position
                    rawData = wx_report(config.wx_lat, config.wx_lon, config.wx_alt, "");
                    if (config.log & LOG_WX)
                    {
                        logWeather(config.wx_lat, config.wx_lon, 0, 0);
                    }
                }
                if (rawData != "")
                {
                    WxInterval = millis() + (config.wx_interval * 1000);
                    Sleep_Activate &= ~ACTIVATE_WX;
                    StandByTick = millis() + (5000);
                    log_d("WX_REPORT: %s", rawData.c_str());
                    uint8_t SendMode = 0;
                    if (config.wx_2rf)
                        SendMode |= RF_CHANNEL;
                    if (config.wx_2inet)
                        SendMode |= INET_CHANNEL;
                    pkgTxPush(rawData.c_str(), rawData.length(), 0, SendMode);
//                     if (config.wx_2rf)
//                     { // WX SEND POSITION TO RF
//                         char *rawP = (char *)calloc(rawData.length(), sizeof(char));
//                         // rawData.toCharArray(rawP, rawData.length());
//                         memcpy(rawP, rawData.c_str(), rawData.length());
//                         pkgTxPush(rawP, rawData.length(), 0);
#ifdef OLED
                    sprintf(sts, "--src call--\n%s\nDelay: %dms.", config.wx_mycall, (config.wx_interval * 1000));
                    if(config.oled_enable) pushTxDisp(TXCH_RF, "WX REPORT", sts);
#endif
                    //                         free(rawP);
                    //                     }
                    //                     if (config.wx_2inet)
                    //                     { // WX SEND TO APRS-IS
                    //                         if (aprsClient.connected())
                    //                         {
                    //                             status.txCount++;
                    //                             aprsClient.println(rawData); // Send packet to Inet
                    // #ifdef OLED
                    //                             // pushTxDisp(TXCH_TCP, "WX REPORT", sts);
                    // #endif
                    //                         }
                    //                     }
                }
                else
                {
                    WxInterval = millis() + (10 * 1000);
                }
#ifdef MQTT
                if (config.en_mqtt && (config.mqtt_topic_flag & MQTT_TOPIC_WX) && clientMQTT.connected())
                {
                    char payload[500];
                    char topic[100];
                    if(strlen(config.wx_object)<3)
                        sprintf(topic,"/%s/WEATHER/sample",config.wx_mycall);
                    else
                        sprintf(topic,"/%s/WEATHER/sample",config.wx_object);
                    getWxJson(&payload[0],false);
                    log_d("Publish MQTT Topic: %s Payload: %s", config.mqtt_topic, payload);
                    clientMQTT.publish(config.mqtt_topic, payload);
                }
#endif                
            }
#ifdef MQTT            
            if (millis() > WxIntervalAvg)
            {
                WxIntervalAvg = millis() + (600 * 1000);
                if (config.en_mqtt && (config.mqtt_topic_flag & MQTT_TOPIC_WX) && clientMQTT.connected())
                {
                    char payload[500];
                    char topic[100];
                    if(strlen(config.wx_object)<3)
                        sprintf(topic,"/%s/WEATHER/average",config.wx_mycall);
                    else
                        sprintf(topic,"/%s/WEATHER/average",config.wx_object);
                    getWxJson(&payload[0],true);
                    log_d("Publish MQTT Topic: %s Payload: %s", topic, payload);
                    clientMQTT.publish(topic, payload);
                }
            }
#endif               
        }

        if (config.tlm0_en)
        {
            if (systemTLM.ParmTimeout < millis())
            {
                systemTLM.ParmTimeout = millis() + (config.tlm0_info_interval * 1000);
                char rawInfo[100];
                char name[10];
                sprintf(rawInfo, "PARM.");
                for (int i = 0; i < 13; i++)
                {
                    if (i > 0)
                        strcat(rawInfo, ",");
                    sprintf(name, "%s", config.tlm0_PARM[i]);
                    strcat(rawInfo, name);
                }
                sendTelemetry_0(rawInfo, true);
                memset(rawInfo, 0, sizeof(rawInfo));
                sprintf(rawInfo, "UNIT.");
                for (int i = 0; i < 13; i++)
                {
                    if (i > 0)
                        strcat(rawInfo, ",");
                    sprintf(name, "%s", config.tlm0_UNIT[i]);
                    strcat(rawInfo, name);
                }
                sendTelemetry_0(rawInfo, true);
                memset(rawInfo, 0, sizeof(rawInfo));
                sprintf(rawInfo, "EQNS.");
                for (int i = 0; i < 5; i++)
                {
                    if (i > 0)
                        strcat(rawInfo, ",");
                    if (fmod(config.tlm0_EQNS[i][0], 1) == 0)
                        sprintf(name, "%0.f", config.tlm0_EQNS[i][0]);
                    else
                        sprintf(name, "%.3f", config.tlm0_EQNS[i][0]);
                    strcat(rawInfo, name);
                    if (fmod(config.tlm0_EQNS[i][1], 1) == 0)
                        sprintf(name, ",%0.f", config.tlm0_EQNS[i][1]);
                    else
                        sprintf(name, ",%.3f", config.tlm0_EQNS[i][1]);
                    strcat(rawInfo, name);
                    if (fmod(config.tlm0_EQNS[i][2], 1) == 0)
                        sprintf(name, ",%0.f", config.tlm0_EQNS[i][2]);
                    else
                        sprintf(name, ",%.3f", config.tlm0_EQNS[i][2]);
                    strcat(rawInfo, name);
                }
                sendTelemetry_0(rawInfo, true);
                memset(rawInfo, 0, sizeof(rawInfo));
                sprintf(rawInfo, "BITS.");
                uint8_t b = 1;
                for (int i = 0; i < 8; i++)
                {
                    if (config.tlm0_BITS_Active & b)
                    {
                        strcat(rawInfo, "1");
                    }
                    else
                    {
                        strcat(rawInfo, "0");
                    }
                    b <<= 1;
                }
                strcat(rawInfo, ",");
                strcat(rawInfo, config.tlm0_comment);
                sendTelemetry_0(rawInfo, true);
            }

            if (systemTLM.TeleTimeout < millis())
            {
                systemTLM.TeleTimeout = millis() + (config.tlm0_data_interval * 1000);
                char rawTlm[100];
                if (systemTLM.Sequence > 999)
                    systemTLM.Sequence = 0;
                else
                    systemTLM.Sequence++;
                getTelemetry_0();
                sprintf(rawTlm, "T#%03d,%03d,%03d,%03d,%03d,%03d,", systemTLM.Sequence, systemTLM.A1, systemTLM.A2, systemTLM.A3, systemTLM.A4, systemTLM.A5);
                uint8_t b = 1;
                for (int i = 0; i < 8; i++)
                {
                    if (!((systemTLM.BITS & b) ^ (config.tlm0_BITS_Active & b)))
                    {
                        strcat(rawTlm, "1");
                    }
                    else
                    {
                        strcat(rawTlm, "0");
                    }
                    b <<= 1;
                }
                sendTelemetry_0(rawTlm, false);
            }
        }
    }
}

void taskAPRSPoll(void *pvParameters)
{
    afskSetModem(config.modem_type, config.audio_lpf, config.tx_timeslot, config.preamble * 100, config.fx25_mode);
    afskSetSQL(config.rf_sql_gpio, config.rf_sql_active);
    afskSetPTT(config.rf_ptt_gpio, config.rf_ptt_active);
    afskSetPWR(config.rf_pwr_gpio, config.rf_pwr_active);
    
