nakhonthai/ESP32APRS_Audio/src/main.cpp
    // afskSetDCOffset(config.adc_dc_offset);
    afskSetADCAtten(config.adc_atten);

#ifdef STRIP_PIN
    AFSK_init(config.adc_gpio, config.dac_gpio, config.rf_ptt_gpio, config.rf_sql_gpio, config.rf_pwr_gpio, -1, -1, STRIP_PIN, config.rf_ptt_active, config.rf_sql_active, config.rf_pwr_active);
#else
    AFSK_init(config.adc_gpio, config.dac_gpio, config.rf_ptt_gpio, config.rf_sql_gpio, config.rf_pwr_gpio, LED_TX_PIN, LED_RX_PIN, -1, config.rf_ptt_active, config.rf_sql_active, config.rf_pwr_active);
#endif
    setPtt(false);
    log_d("APRS Polling Task Start on Core %d.", xPortGetCoreID());
    for (;;)
    {
        if (config.modem_type == 3)
            vTaskDelay(1 / portTICK_PERIOD_MS);
        else
            vTaskDelay(3 / portTICK_PERIOD_MS);

        if (AFSKInitAct == true)
        {
            AFSK_Poll(false, LOW);
        }
    }
}

int mqttRetry = 0;
long wifiTTL = 0;

// WiFi connect timeout per AP. Increase when connecting takes longer.
const uint32_t connectTimeoutMs = 60000;
uint8_t APStationNum = 0;
unsigned long waitISRetry = 0;
unsigned long lastHeardTimeout = 0;

pppType pppStatus;

IPAddress ap_ip(192, 168, 4, 1);
IPAddress ap_mask(255, 255, 255, 0);
IPAddress ap_leaseStart(192, 168, 4, 2);
IPAddress ap_dns(8, 8, 4, 4);

uint8_t wifiStatus = WL_DISCONNECTED;
bool vpnConnected = false;
bool wifiDisconnecting = false;
uint16_t wifiDisCount=0;
unsigned long vpnTimeout=0;

void onEvent(arduino_event_id_t event, arduino_event_info_t info)
{
    switch (event)
    {
    #ifdef PPPOS
    case ARDUINO_EVENT_PPP_START:
        log_d("PPP Started");
        break;
    case ARDUINO_EVENT_PPP_CONNECTED:
        log_d("PPP Connected");
        if(!WiFi.isConnected()){
            if(config.vpn){
                log_d("Setup Wireguard VPN by PPP!");
                vpnConnected = false;
                vpnTimeout=millis()+3000;
            }
        
#ifdef MQTT
        if (config.en_mqtt)
        {
            if (!clientMQTT.connected())
            {
                clientMQTT.disconnect();
                clientMQTT.setServer(config.mqtt_host, config.mqtt_port);
                clientMQTT.setCallback(mqtt_callback);
            }
            mqtt_reconnect();
        }
#endif
        }
        break;
    case ARDUINO_EVENT_PPP_GOT_IP:
        pppStatus.ip = info.got_ip.ip_info.ip.addr;
        pppStatus.gateway = info.got_ip.ip_info.gw.addr;
        pppStatus.netmask = info.got_ip.ip_info.netmask.addr;
        log_d("PPP Got IP");
        log_d("PPP IP: %s", IPAddress(pppStatus.ip).toString().c_str());
        log_d("PPP Gateway: %s", IPAddress(pppStatus.gateway).toString().c_str());
        log_d("PPP Subnet: %s", IPAddress(pppStatus.netmask).toString().c_str());
        WiFi.AP.enableNAPT(config.ppp_napt);
        break;
    case ARDUINO_EVENT_PPP_LOST_IP:
        log_d("PPP Lost IP");
        WiFi.AP.enableNAPT(false);
        pppTimeout = millis() + (60 * 1000);
        break;
    case ARDUINO_EVENT_PPP_DISCONNECTED:
        log_d("PPP Disconnected");
        WiFi.AP.enableNAPT(false);
        pppTimeout = millis() + (60 * 1000);
        break;
    case ARDUINO_EVENT_PPP_STOP:
        log_d("PPP Stopped");
        break;
    #endif

    case ARDUINO_EVENT_WIFI_AP_START:
        log_d("AP Started");
        Serial.println(WiFi.AP);
        break;
    case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
        log_d("AP STA Connected");
        break;
    case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
        log_d("AP STA Disconnected");
        break;
    case ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED:
        log_d("AP STA IP Assigned: ");
        log_d("%s", IPAddress(info.wifi_ap_staipassigned.ip.addr).toString().c_str());
        break;
    case ARDUINO_EVENT_WIFI_AP_PROBEREQRECVED:
        log_d("AP Probe Request Received");
        break;
    case ARDUINO_EVENT_WIFI_AP_STOP:
        log_d("AP Stopped");
        break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
        wifiDisCount=0;
        wifiDisconnecting = false;
// String info = "WiFi Infor:";
// info += "\nSSID: " + WiFi.SSID();
// info += "\nRSSI: " + String(WiFi.RSSI()) + "dBm";
// info += "\nIP: " + WiFi.localIP().toString();
// info += "\nGW IP: " + WiFi.gatewayIP().toString();
// info += "\nMAC: " + WiFi.macAddress();
// lv_label_set_text(ui_txtSystemInfo, info.c_str());
        if(config.vpn){
            log_d("Setup Wireguard VPN by WiFi!");
            vpnConnected = false;
            vpnTimeout=millis()+3000;
        }
#ifdef MQTT
        if (config.en_mqtt)
        {
            if (!clientMQTT.connected())
            {
                clientMQTT.disconnect();
                clientMQTT.setServer(config.mqtt_host, config.mqtt_port);
                clientMQTT.setCallback(mqtt_callback);
            }
            mqtt_reconnect();
        }
#endif        
        log_d("WiFi Connected");
        break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
        log_d("WiFi Disconnected");
        wifiDisCount++;        
        // if(wifiDisCount%5==0){
        //     log_d("WiFi Disconnected count=%d",wifiDisCount);
        //     WiFi.disconnect(true,true);            
        //     wifiMulti.run(); // Move to next AP             
        //     WiFi.reconnect();
        // }
        if(wifiDisconnecting==false && wifiDisCount>10){
            wifiDisCount=0;
            wifiDisconnecting = true; 
            pingTimeout = millis() + 10000;
            #ifdef MQTT
        if (config.en_mqtt)
        {
            if (!clientMQTT.connected())
            {
                clientMQTT.disconnect();
                clientMQTT.setServer(config.mqtt_host, config.mqtt_port);
                clientMQTT.setCallback(mqtt_callback);
            }
            mqtt_reconnect();
        }
#endif                           
        #ifdef PPPOS
        if(config.vpn ){            
            //if(PPP.connected()){
                vpnConnected = false;  
                vpnTimeout=millis()+1000;              
            //}
        }
        #endif
        }
        break;
    default:
        break;
    }
}

long int pppTimeout = 0;

#ifdef PPPOS

void PPPOS_Start()
{
    if (config.ppp_enable)
    {        
        pppTimeout = millis() + (600 * 1000);
        log_d("Starting the modem. It might take a while!");
        PPP.end();
        pinMode(config.ppp_rst_gpio, OUTPUT);
        digitalWrite(config.ppp_rst_gpio, config.ppp_rst_active);
        delay(config.ppp_rst_delay);
        digitalWrite(config.ppp_rst_gpio, !config.ppp_rst_active);
        // pinMode(39, INPUT_PULLUP); // Set GPIO39 as input with pull-up resistor
        //  digitalWrite(39, HIGH); // Set GPIO39 to high to enable pull-up resistor
        delay(1000); // Wait for the modem to reset
        
