nakhonthai/ESP32APRS_Audio/src/main.cpp
        PPP.setApn(config.ppp_apn);     // Set the APN for the modem
        PPP.setResetPin(config.ppp_rst_gpio, config.ppp_rst_active, config.ppp_rst_delay);
        PPP.setPins(config.ppp_tx_gpio, config.ppp_rx_gpio);
        log_d("PPP Modem Init...");
        log_d("Using UART %d as PPP interface", config.ppp_serial);
        if(config.ppp_serial>1) return;
        if (PPP.begin(PPP_MODEM_MODEL, config.ppp_serial, 115200))
        {
            log_d("PPP started successfully");
        }
        else
        {
            log_d("PPP failed to start");
            sprintf(pppStatus.manufacturer, "Not found modem");
            sprintf(pppStatus.model, "N/A");
            return;
        }

        // Configure the modem
        if (config.ppp_gnss)
        {
            Serial.println(PPP.cmd("AT+QGPSCFG=\"outport\",\"uartdebug\"", 10000)); // กำหนดให้ NMEA output ผ่านพอร์ต UART Debug
            Serial.println(PPP.cmd("AT+QGPSCFG=\"nmeasrc\",0", 10000));             // ปิดการดึง NMEA sentence ผ่าน AT+QGPSGNMEA
            Serial.println(PPP.cmd("AT+QGPSCFG=\"gpsnmeatype\",63", 10000));        // เปิดใช้งาน NMEA sentence ทั้งหมด (GGA, RMC, GSV, GSA, VTG, GLL)
            Serial.println(PPP.cmd("AT+QGPSCFG=\"gnssconfig\",1", 10000));          // เลือกใช้ระบบดาวเทียม GPS + BeiDou
            Serial.println(PPP.cmd("AT+QGPSCFG=\"autogps\",0", 10000));             // ปิดใช้งาน GNSS อัตโนมัติเมื่อโมดูลเริ่มทำงาน
            Serial.println(PPP.cmd("AT+QGPSCFG=\"apflash\",1", 10000));             // เปิดใช้งาน AP-Flash เพื่อการเริ่มต้นที่รวดเร็ว
            Serial.println(PPP.cmd("AT+QGPS=1", 10000));
        }
        
        PPP.cmd("AT+CTZU=1", 1000); // Enable automatic time zone update
        // PPP.setUser(ppp_user);
        // PPP.setPass(ppp_pass);
        // PPP.setApn(config.ppp_apn);
        // PPP.setPin(config.ppp_pin);
        // PPP.setResetPin(config.ppp_rst_gpio, config.ppp_rst_active, config.ppp_rst_delay);
        // PPP.setPins(config.ppp_tx_gpio, config.ppp_rx_gpio, config.ppp_rts_gpio, config.ppp_cts_gpio, PPP_MODEM_FC);

        PPP.setBaudrate(config.ppp_serial_baudrate); // Set the baud rate for the modem
        sprintf(pppStatus.manufacturer, "%s", PPP.cmd("AT+CGMI", 10000).c_str());
        sprintf(pppStatus.model, "%s", PPP.moduleName().c_str());
        sprintf(pppStatus.imei, "%s", PPP.IMEI().c_str());
        log_d("Manufacturer: %s", pppStatus.manufacturer);
        log_d("Model: %s", pppStatus.model);
        log_d("IMEI: %s", pppStatus.imei);

        bool attached = PPP.attached();
        if (!attached)
        {
            int i = 0;
            unsigned int s = millis();
            log_d("Waiting to connect to network");
            while (!attached && ((++i) < 30))
            {
                log_d(".");
                delay(100);
                attached = PPP.attached();
            }
            log_d("%ds", (millis() - s) / 1000.0);
            attached = PPP.attached();
        }

        log_d("Attached: %d", attached);
        log_d("State: %d", PPP.radioState());
        if (attached)
        {
            sprintf(pppStatus.oper, "%s", PPP.operatorName().c_str());
            sprintf(pppStatus.imsi, "%s", PPP.IMSI().c_str());
            log_d("IMSI: %s", pppStatus.imsi);
            pppStatus.rssi = PPP.RSSI();
            log_d("Operator: %s", pppStatus.oper);
            log_d("RSSI: %d dBm", pppStatus.rssi);
            PPP.started(); // Start the PPP connection            
            //   if(PPP.sms("0984958488","Test SMS from ESP32")){
            //       log_d("SMS sent successfully!");
            //   } else {
            //       log_d("Failed to send SMS.");
            //   }
            int ber = PPP.BER();
            if (ber > 0)
            {
                log_d("BER: %i", ber);
                log_d("NetMode: %i", PPP.networkMode());
            }

            log_d("Switching to data mode...");
            PPP.mode(ESP_MODEM_MODE_DATA); // Data and Command mixed mode
            if (!PPP.waitStatusBits(ESP_NETIF_CONNECTED_BIT, 5000))
            {
                log_d("Failed to connect to internet!");
                PPP.mode(ESP_MODEM_MODE_COMMAND); // Switch back to command mode
            }
            else
            {
                log_d("Connected to internet!");
            }
        }
        else
        {
            log_d("Failed to connect to network!");
        }
    }
}
#endif

void taskNetwork(void *pvParameters)
{
    int c = 0;
    // char raw[500];
    log_d("Task Network has been start");
    // manualWiFi = true;

    // Listen for modem events
    Network.onEvent(onEvent);

    // WiFi.onEvent(Wifi_connected,SYSTEM_EVENT_STA_CONNECTED);
    // WiFi.onEvent(Get_IPAddress, SYSTEM_EVENT_STA_GOT_IP);
    // WiFi.onEvent(Wifi_disconnected, SYSTEM_EVENT_STA_DISCONNECTED);

    if (config.wifi_mode == WIFI_STA_FIX)
    { /**< WiFi station mode */
        WiFi.mode(WIFI_MODE_STA);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_FIX)
    { /**< WiFi soft-AP mode */
        WiFi.mode(WIFI_MODE_AP);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else if (config.wifi_mode == WIFI_AP_STA_FIX)
    { /**< WiFi station + soft-AP mode */
        WiFi.mode(WIFI_MODE_APSTA);
        WiFi.setTxPower((wifi_power_t)config.wifi_power);
    }
    else
    {
        WiFi.mode(WIFI_MODE_NULL);
    }

    if (config.wifi_mode & WIFI_STA_FIX)
    {
        for (int i = 0; i < 5; i++)
        {
            if (config.wifi_sta[i].enable)
            {
                wifiMulti.addAP(config.wifi_sta[i].wifi_ssid, config.wifi_sta[i].wifi_pass);
            }
        }
        WiFi.setHostname("ESP32APRS_Audio");
        if (wifiMulti.run() == WL_CONNECTED)
        {
            NTP_Timeout = millis() + 2000;
        }
    }

    if (config.wifi_mode & WIFI_AP_FIX)
    {
        // manualWiFi = true;
        log_d("Access point running. IP address: ");
        log_d("%s", WiFi.softAPIP().toString().c_str());
        // Start the Access Point
        WiFi.AP.begin();
        WiFi.AP.config(ap_ip, ap_ip, ap_mask, ap_leaseStart, ap_dns);
        WiFi.AP.create(config.wifi_ap_ssid, config.wifi_ap_pass);
        if (!WiFi.AP.waitStatusBits(ESP_NETIF_STARTED_BIT, 1000))
        {
            Serial.println("Failed to start AP!");
            // return;
        }
    }

    if (wifiMulti.run() == WL_CONNECTED)
    {
        log_d("Wi-Fi CONNECTED!");
        log_d("IP address: %s", WiFi.localIP().toString().c_str());
        NTP_Timeout = millis() + 5000;
    }

    pingTimeout = millis() + 10000;
    unsigned long timeNetworkOld = millis();
    timeNetwork = 0;
    if (config.wifi_mode & WIFI_AP_STA_FIX)
        webService();

