nakhonthai/ESP32APRS_Audio/src/main.cpp
#ifdef OLED
#ifdef SSD1306_72x40
    display.clearDisplay();
    display.fillRect(0, 0, 72, 9, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(24, 1);
    display.print("GNSS");
    display.setTextColor(WHITE);
    str = "LAT " + String(gps.location.lat(), 4);
    display.setCursor(0, 12);
    display.print(str);
    str = "LON " + String(gps.location.lng(), 4);
    display.setCursor(0, 22);
    display.print(str);
    str = "Alt " + String(gps.altitude.meters(), 0) + "m";
    display.setCursor(0, 32);
    display.print(str);

#else
    if (gps_mode == 0)
    {
        display.fillRect(0, 0, 128, 15, WHITE);
        display.drawRect(0, 16, 128, 48, WHITE);
        display.fillRect(1, 17, 126, 46, BLACK);

        display.setCursor(20, 7);
        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
        display.setTextColor(BLACK);

        // display.fillRect(0, 16, 128, 10, WHITE);
        // display.drawLine(0, 16, 0, 63, WHITE);
        // display.drawLine(127, 16, 127, 63, WHITE);
        // display.drawLine(0, 63, 127, 63, WHITE);
        // display.fillRect(1, 25, 126, 38, BLACK);
        // display.setTextColor(BLACK);
        // display.setCursor(35, 17);
        display.print("GPS INFO");
        display.setCursor(119, 17);
        display.print("0");
        display.setTextColor(WHITE);
        display.setFont();

        display.setCursor(3, 18);
        display.print("LAT:");
        str = String(gps.location.lat(), 5);
        x = str.length() * 6;
        display.setCursor(80 - x, 18);
        display.print(str);

        display.setCursor(3, 26);
        display.print("LON:");
        str = String(gps.location.lng(), 5);
        x = str.length() * 6;
        display.setCursor(80 - x, 26);
        display.print(str);

        display.drawYBitmap(90, 19, &Icon_TableB[50][0], 16, 16, WHITE);
        display.setCursor(110, 25);
        display.print(gps.satellites.value());

        display.setCursor(3, 35);
        display.print("ALT:");
        str = String(gps.altitude.meters(), 0) + "m";
        x = str.length() * 6;
        display.setCursor(80 - x, 35);
        display.print(str);

        display.setCursor(3, 44);
        display.print("SPD:");
        str = String(gps.speed.kmph(), 1) + "kph";
        x = str.length() * 6;
        display.setCursor(80 - x, 44);
        display.print(str);

        display.setCursor(90, 44);
        display.print("CST:");
        str = String(gps.course.deg(), 0);
        x = str.length() * 6;
        display.setCursor(126 - x, 44);
        display.print(str);

        display.setCursor(3, 54);
        // display.print("TIME:");
        str = String(gps.date.day(), DEC) + "/" + String(gps.date.month(), DEC) + "/" + String(gps.date.year(), DEC);
        display.setCursor(3, 53);
        display.print(str);
        str = String(gps.time.hour(), DEC) + ":" + String(gps.time.minute(), DEC) + ":" + String(gps.time.second(), DEC) + "z";
        x = str.length() * 6;
        display.setCursor(126 - x, 53);
        display.print(str);
    }
    else
    {
        // display.clearDisplay();
        display.fillRect(0, 0, 128, 64, BLACK);
        display.drawYBitmap(90, 0, &Icon_TableB[50][0], 16, 16, WHITE);
        display.setCursor(107, 7);
        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
        display.print(gps.satellites.value());

        struct tm tmstruct;
        char strTime[10];
        tmstruct.tm_year = 0;
        getLocalTime(&tmstruct, 100);
        sprintf(strTime, "%02d:%02d:%02d", tmstruct.tm_hour, tmstruct.tm_min, tmstruct.tm_sec);
        display.setCursor(0, 14);
        display.print(strTime);

        // if (config.dim == 2)
        // { // Auto dim timeout
        //     if (millis() > (dimTimeout + 60000))
        //     {
        //         display.dim(true);
        //     }
        //     else
        //     {
        //         display.dim(false);
        //     }
        // }
        // else if (config.dim == 3)
        // { // Dim for time
        //     if (tmstruct.tm_hour > 5 && tmstruct.tm_hour < 19)
        //     {
        //         display.dim(false);
        //     }
        //     else
        //     {
        //         display.dim(true);
        //     }
        // }

        display.setFont(&FreeSerifItalic9pt7b);
        display.setCursor(80, 28);
        display.printf("km/h");

        display.setFont(&Seven_Segment24pt7b);
        display.setCursor(70, 63);
        display.print(SB_SPEED, DEC);

        compass_label(25, 42, 19, 0.0F, WHITE);
        compass_arrow(25, 42, 16, SB_HEADING, WHITE);
        display.drawLine(0, 16, 60, 16, WHITE);
        display.drawLine(60, 16, 70, 29, WHITE);
        display.drawLine(50, 16, 60, 29, WHITE);
        display.drawLine(60, 29, 127, 29, WHITE);
        display.setFont();
    }
#endif
    display.display();
#elif defined(ST7735_160x80)
    if (gps_mode == 0)
    {
        display.fillRect(0, 0, 160, 15, WHITE);
        // display.drawRect(0, 16, 160, 64, WHITE);
        display.fillRect(0, 15, 160, 64, BLACK);

        display.setCursor(60, 7);
        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
        display.setTextColor(BLACK);
        display.print("GNSS");
        display.setFont();
        display.setCursor(150, 7);
        display.print("0");

        display.setTextColor(WHITE);
        display.setCursor(3, 18);
        display.print("LAT:");
        str = String(gps.location.lat(), 5);
        x = str.length() * 6;
        display.setCursor(90 - x, 18);
        display.print(str);

        display.setCursor(3, 28);
        display.print("LON:");
        str = String(gps.location.lng(), 5);
        x = str.length() * 6;
        display.setCursor(90 - x, 28);
        display.print(str);

        display.drawYBitmap(120, 20, &Icon_TableB[50][0], 16, 16, ST77XX_BLUE);
        display.setCursor(140, 27);
        display.print(gps.satellites.value());

        display.setCursor(3, 38);
        display.print("SPD:");
        str = String(gps.speed.kmph(), 1) + "kph";
        x = str.length() * 6;
        display.setCursor(90 - x, 38);
        display.print(str);

        display.setCursor(3, 48);
        display.print("ALT:");
        str = String(gps.altitude.meters(), 0) + "m";
        x = str.length() * 6;
        display.setCursor(90 - x, 48);
        display.print(str);

